tests/golden/detached_head_normal.dot
digraph {
	graph [rankdir=RL]
	HEAD [label=HEAD color="0.000 1.000 1.000" fillcolor="0.000 0.100 1.000" penwidth=2 style=filled]
	HEAD -> d985e3fe522b7bdefa3e2f92e61c8e711765b114 [label=HEAD]
	d985e3fe522b7bdefa3e2f92e61c8e711765b114 [label="commit
d985e" color="0.222 1.000 1.000" fillcolor="0.222 0.100 1.000" penwidth=2 style=filled]
	"refs/heads/main" [label=main color="0.000 1.000 1.000" fillcolor="0.000 0.100 1.000" penwidth=2 style=filled]
	"refs/heads/main" -> "2ffc39fe3f2ec3a1998a9715d9a456ed74e06b39" [label=branch]
	"2ffc39fe3f2ec3a1998a9715d9a456ed74e06b39" [label="commit
2ffc3" color="0.222 1.000 1.000" fillcolor="0.222 0.100 1.000" penwidth=2 style=filled]
	"2ffc39fe3f2ec3a1998a9715d9a456ed74e06b39" -> d985e3fe522b7bdefa3e2f92e61c8e711765b114 [label=parent]
}
