tests/golden/detached_head_normal.mermaid
flowchart RL
    HEAD["HEAD"]
    d985e3fe522b7bdefa3e2f92e61c8e711765b114["commit<br/>d985e"]
    refs_heads_main["main"]
    2ffc39fe3f2ec3a1998a9715d9a456ed74e06b39["commit<br/>2ffc3"]
    HEAD --> d985e3fe522b7bdefa3e2f92e61c8e711765b114
    refs_heads_main --> 2ffc39fe3f2ec3a1998a9715d9a456ed74e06b39
    2ffc39fe3f2ec3a1998a9715d9a456ed74e06b39 --> d985e3fe522b7bdefa3e2f92e61c8e711765b114
    style HEAD fill:#ffe5e5,stroke:#ff0000,stroke-width:2px
    style d985e3fe522b7bdefa3e2f92e61c8e711765b114 fill:#f6ffe5,stroke:#aaff00,stroke-width:2px
    style refs_heads_main fill:#ffe5e5,stroke:#ff0000,stroke-width:2px
    style 2ffc39fe3f2ec3a1998a9715d9a456ed74e06b39 fill:#f6ffe5,stroke:#aaff00,stroke-width:2px
